In [283]:
import sys
import os

repo_root = os.path.abspath(os.path.join(os.path.dirname(os.getcwd())))
sys.path.append(repo_root)

print(repo_root)

/home/jackyeung99/classes/class_financial-econometrics

In [284]:
import matplotlib.pyplot as plt
import math 
import numpy as np
import pandas as pd
from pandas_datareader import data as pdr

In [285]:
data = [
        'TB3MS', # us interest rate
        'CLVMNACSCAB1GQSE',# sweden GDP
        'SWECPIALLMINMEI', # swedish CPI
        'IR3TIB01SEM156N', # interest rate sweden 
        'CCRETT01SEM661N'# real effective interest rate 
        ]

In [286]:
df = pdr.DataReader(
    data,
    "fred",
    start="1992-01-01",
    end="2025-07-01",
).astype(float)

In [287]:
df['CLVMNACSCAB1GQSE'] = df['CLVMNACSCAB1GQSE'].interpolate(method='linear')
df['SWECPIALLMINMEI'] = df['SWECPIALLMINMEI'].interpolate(method='linear')

In [288]:
df = df.resample('Q').mean()

/tmp/ipykernel_2051/2350885638.py:1: FutureWarning: 'Q' is deprecated and will be removed in a future version, please use 'QE' instead.
  df = df.resample('Q').mean()

In [289]:
df['pit'] = 400 * np.log(df['SWECPIALLMINMEI']/ df['SWECPIALLMINMEI'].shift(1))

In [290]:
df = df.dropna()

In [291]:
df = df.rename(columns = {
    'TB3MS': 'i_star',
    'CLVMNACSCAB1GQSE' : 'yt',
    # 'SWECPIALLMINMEI': 'pit',
    'IR3TIB01SEM156N': 'it',
    'CCRETT01SEM661N': 'et'

})

In [292]:
df['yt'] = np.log(df['yt'])
df['et'] = np.log(df['et'])

In [293]:
df['d1t'] = (df.index == '1993-03-31').astype(int)
df['d2t'] = (df.index == '1995-12-31').astype(int)
df['d3t'] = (df.index == '1992-09-30').astype(int)

In [294]:
df

,i_star,yt,SWECPIALLMINMEI,it,et,pit,d1t,d2t,d3t
DATE,,,,,,,,,
1993-03-31,2.960000,13.230199,77.312870,9.596667,4.860327,12.391918,1,0,0
1993-06-30,2.966667,13.237378,77.723493,8.846667,4.852091,2.118854,0,0,0
1993-09-30,3.003333,13.241793,77.627757,7.776667,4.800584,-0.493008,0,0,0
1993-12-31,3.060000,13.247501,78.269217,7.186667,4.783150,3.291731,0,0,0
1994-03-31,3.243333,13.260861,78.580907,6.996667,4.815809,1.589749,0,0,0
...,...,...,...,...,...,...,...,...,...
2024-09-30,4.990000,13.935813,132.395800,3.363063,4.481897,-0.953375,0,0,0
2024-12-31,4.400000,13.939226,132.863833,2.678993,4.475312,1.411549,0,0,0
2025-03-31,4.210000,13.940779,133.170233,2.303590,4.489092,0.921386,0,0,0
2025-06-30,4.230000,13.948407,132.824500,2.252997,4.518427,-1.039821,0,0,0
2025-09-30,4.250000,13.955479,132.824500,2.078740,4.513894,0.000000,0,0,0

In [295]:
df.drop(columns=['SWECPIALLMINMEI']).to_csv('sweden.csv')

In [296]:
df[df[['d1t','d2t','d3t']].any(axis=1)]

,i_star,yt,SWECPIALLMINMEI,it,et,pit,d1t,d2t,d3t
DATE,,,,,,,,,
1993-03-31,2.96,13.230199,77.312870,9.596667,4.860327,12.391918,1,0,0
1995-12-31,5.26,13.330604,81.880777,8.773333,4.859358,1.963987,0,1,0